Белгипрозем_2017/src/Catalogs/Нумераторы/Нумераторы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Нумераторы</name>
  <predefined>
    <items>
      <name>ВнутренниеДокументы</name>
      <description>Внутренние документы</description>
    </items>
    <items>
      <name>ВходящиеДокументы</name>
      <description>Входящие документы</description>
    </items>
    <items>
      <name>ИсходящиеДокументы</name>
      <description>Исходящие документы</description>
    </items>
    <items>
      <name>ФайлыЕРИП</name>
      <description>Файлы ЕРИП</description>
    </items>
    <items>
      <name>Штрихкоды</name>
      <description>Штрихкоды</description>
    </items>
  </predefined>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.ПериодичностьНумераторов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматНомера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НезависимаяНумерацияПоОрганизациям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НезависимаяНумерацияПоСвязанномуДокументу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НезависимаяНумерацияПоПодразделению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НезависимаяНумерацияПоПроекту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НезависимаяНумерацияПоВопросуДеятельности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСвязи</name>
    <type>
      <types>CatalogRef.ТипыСвязей</types>
    </type>
  </attributes>
</mdclass:Catalog>

Белгипрозем_2017/src/InformationRegisters/НастройкаСвязей/НастройкаСвязей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкаСвязей</name>
  <resources>
    <name>ХарактерСвязи</name>
    <type>
      <types>EnumRef.ХарактерСвязей</types>
    </type>
  </resources>
  <resources>
    <name>ТипОбратнойСвязи</name>
    <type>
      <types>CatalogRef.ТипыСвязей</types>
    </type>
  </resources>
  <resources>
    <name>ХарактерОбратнойСвязи</name>
    <type>
      <types>EnumRef.ХарактерСвязей</types>
    </type>
  </resources>
  <attributes>
    <name>Предопределенная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Обязательная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ТипСвязи</name>
    <type>
      <types>CatalogRef.ТипыСвязей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СсылкаИз</name>
    <type>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.ВходящееСообщениеСВД</types>
      <types>DocumentRef.ИсходящееСообщениеСВД</types>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
      <types>CatalogRef.ВидыВнутреннихДокументов</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВидыВходящихДокументов</types>
      <types>CatalogRef.Мероприятия</types>
      <types>CatalogRef.ВидыИсходящихДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СсылкаНа</name>
    <type>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.ВходящееСообщениеСВД</types>
      <types>DocumentRef.ИсходящееСообщениеСВД</types>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
      <types>CatalogRef.ВидыВнутреннихДокументов</types>
      <types>CatalogRef.Файлы</types>
      <types>String</types>
      <types>CatalogRef.ВидыВходящихДокументов</types>
      <types>CatalogRef.Мероприятия</types>
      <types>CatalogRef.ВидыИсходящихДокументов</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/Enums/ХарактерСвязей/ХарактерСвязей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХарактерСвязей</name>
  <enumValues>
    <name>Единичная</name>
  </enumValues>
  <enumValues>
    <name>Множественная</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Catalogs/Нумераторы/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ОписаниеОшибки = "";
	СтруктураФорматаНомера = Неопределено;
	
	Если Не Нумерация.РазобратьФорматНомера(ФорматНомера, ОписаниеОшибки, СтруктураФорматаНомера) Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Ошибка в формате номера: %1'"), ОписаниеОшибки);

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			"ФорматНомера",,
			Отказ);
		Возврат;	
	КонецЕсли;
	
	НайденТегНомер = Ложь;
	Для Каждого Строка Из СтруктураФорматаНомера Цикл
		Если Строка.Ключ = "СлужебноеПоле" И Строка.Значение = "Номер" Тогда 
			НайденТегНомер = Истина;
		КонецЕсли;	
	КонецЦикла;
	Если Не НайденТегНомер Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Формат номера не содержит служебное поле ""Номер""'"),
			ЭтотОбъект,
			"ФорматНомера",,
			Отказ);
	КонецЕсли;	
	
	Если (Найти(ФорматНомера, "НомерСвязДок") > 0) Или НезависимаяНумерацияПоСвязанномуДокументу Тогда 
		ПроверяемыеРеквизиты.Добавить("ТипСвязи");
	КонецЕсли;	
	
	// Проверка настроек типа связи
	Если ЗначениеЗаполнено(ТипСвязи) Тогда 
		
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	НастройкаСвязей.СсылкаНа,
		|	ВЫБОР
		|		КОГДА НастройкаСвязей.ХарактерСвязи = ЗНАЧЕНИЕ(Перечисление.ХарактерСвязей.Множественная)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоМножественнаяСвязь
		|ИЗ
		|	РегистрСведений.НастройкаСвязей КАК НастройкаСвязей
		|ГДЕ
		|	НастройкаСвязей.ТипСвязи = &ТипСвязи";
		
		Запрос.УстановитьПараметр("ТипСвязи", ТипСвязи);
		Выборка = Запрос.Выполнить().Выбрать();
		
		РазрешенныеТипы = Новый Массив;
		РазрешенныеТипы.Добавить(Тип("СправочникСсылка.ВидыВнутреннихДокументов"));
		РазрешенныеТипы.Добавить(Тип("СправочникСсылка.ВидыВходящихДокументов"));
		РазрешенныеТипы.Добавить(Тип("СправочникСсылка.ВидыИсходящихДокументов"));
		
		ЕстьМножественныеСвязи = Ложь;
		НедопустимыеТипы = "";
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.ЭтоМножественнаяСвязь Тогда
				ЕстьМножественныеСвязи = Истина;
			КонецЕсли;
			
			ТипСвязанногоДокумента = ТипЗнч(Выборка.СсылкаНа);
			Если РазрешенныеТипы.Найти(ТипСвязанногоДокумента) = Неопределено Тогда
				
				Если ТипСвязанногоДокумента = Тип("Строка") Тогда
					ПредставлениеНедопустимогоТипа = НСтр("ru = 'Внешняя ссылка'");
				Иначе
					ПредставлениеНедопустимогоТипа = Строка(ТипСвязанногоДокумента);
				КонецЕсли;
				
				НедопустимыеТипы = НедопустимыеТипы + ?(НедопустимыеТипы = "", "", ", ") + ПредставлениеНедопустимогоТипа;
				
			КонецЕсли
			
		КонецЦикла;
		
		Если ЕстьМножественныеСвязи Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'Настройки типа связи не должны содержать связи множественного характера'"),
				ЭтотОбъект,
				"ТипСвязи",,
				Отказ);
		КонецЕсли;
		
		Если НедопустимыеТипы <> "" Тогда
			Если Найти(НедопустимыеТипы, ",") = 0 Тогда 
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Настройки типа связи содержат недопустимый тип связанного документа: %1'"),
					НедопустимыеТипы);
			Иначе
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Настройки типа связи содержат недопустимые типы связанного документа: %1'"),
					НедопустимыеТипы);
			КонецЕсли;	
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстСообщения,
				ЭтотОбъект,
				"ТипСвязи",,
				Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда 
		Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОрганизациям") Тогда 
			НезависимаяНумерацияПоОрганизациям = Истина;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры
